#+BEGIN_COMMENT
.. title: Introduction to the Kaggle Intermediate Machine Learning Tutorial
.. slug: introduction-intermediate-machine-learning
.. date: 2020-02-20 20:59:21 UTC-08:00
.. tags: kaggle,tutorial
.. category: Tutorial
.. link: 
.. description: The first part of the second kaggle machine learning tutorial.
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 
#+PROPERTY: header-args :session /run/user/1000/jupyter/kernel-0a2bf70a-3b93-4b6e-98a7-b40dd113d69e.json
** Preliminary 3: Evaluate Some Models
#+begin_src python :results none
hyperparameters = dict(
    model_1=dict(n_estimators=50, random_state=0),
    model_2 = dict(n_estimators=100, random_state=0),
    model_3 = dict(n_estimators=100, criterion='mae', random_state=0),
    model_4 = dict(n_estimators=200, min_samples_split=20, random_state=0),
    model_5 = dict(n_estimators=100, max_depth=7, random_state=0),
    )

models = [RandomForestRegressor(**parameters) for parameters in hyperparameters.values()]
#+end_src

#+begin_src python :results output :exports both
def score_model(model, X_t=x_train, X_v=x_validate, y_t=y_train, y_v=y_validate):
    model.fit(X_t, y_t)
    preds = model.predict(X_v)
    return mean_absolute_error(y_v, preds)

scores = sorted([(score_model(model), model, index) for index, model in enumerate(models)])

for score, model, index in scores:
    print(f"Model {index} MAE: {score:0.2f}")

best = min(scores)
print()
print(f"Best Model: {best}")
best_model = f"model_{best[2]}"
best_hyperparameters = hyperparameters[best_model]
#+end_src

#+RESULTS:
#+begin_example
Model 2 MAE: 23528.78
Model 4 MAE: 23706.67
Model 1 MAE: 23740.98
Model 3 MAE: 23996.68
Model 0 MAE: 24015.49

Best Model: (23528.78421232877, RandomForestRegressor(bootstrap=True, criterion='mae', max_depth=None,
                      max_features='auto', max_leaf_nodes=None,
                      min_impurity_decrease=0.0, min_impurity_split=None,
                      min_samples_leaf=1, min_samples_split=2,
                      min_weight_fraction_leaf=0.0, n_estimators=100,
                      n_jobs=None, oob_score=False, random_state=0, verbose=0,
                      warm_start=False), 2)
#+end_example

